adapters/sparkasse-adapter/src/test/resources/pis/payments/sepa-credit-transfers/initiate-payment.json

{
  "request": {
    "headers": {
      "X-Request-ID": "e56a3492-e9c7-4357-9b77-0a3bdafdd607",
      "PSU-ID": "chipTAN",
      "TPP-Redirect-URI": "http://localhost:8080/redirect",
      "PSU-IP-Address": "0.0.0.0",
      "TPP-Redirect-Preferred": "false",
      "Content-Type": "application/json; charset=UTF-8"
    },
    "body": {
      "debtorAccount": {
        "iban": "DE86999999990000001000",
        "currency": "EUR"
      },
      "instructedAmount": {
        "currency": "EUR",
        "amount": "10.99"
      },
      "creditorAccount": {
        "iban": "DE86999999990000001000",
        "currency": "EUR"
      },
      "creditorName": "Merchant123"
    }
  },
  "response": {
    "body": {
      "transactionStatus": "RCVD",
      "paymentId": "5f6e3778-2b5c-460c-90f9-c86b0f5c5d57",
      "_links": {
        "startAuthorisationWithPsuAuthentication": {
          "href": "https://xs2a-sandbox.f-i-apim.de:8444/fixs2a-env/xs2a-api/12345678/v1/payments/sepa-credit-transfers/5f6e3778-2b5c-460c-90f9-c86b0f5c5d57/authorisations"
        },
        "self": {
          "href": "https://xs2a-sandbox.f-i-apim.de:8444/fixs2a-env/xs2a-api/12345678/v1/payments/sepa-credit-transfers/5f6e3778-2b5c-460c-90f9-c86b0f5c5d57"
        },
        "status": {
          "href": "https://xs2a-sandbox.f-i-apim.de:8444/fixs2a-env/xs2a-api/12345678/v1/payments/sepa-credit-transfers/5f6e3778-2b5c-460c-90f9-c86b0f5c5d57/status"
        }
      },
      "psuMessage": "Bitte geben Sie Ihren Anmeldenamen/Legitimations-ID und Ihre PIN ein."
    }
  }
}
